def national_quize():

    print("اهلا بك في مسابقة اليوم الوطني السعودي 💚")
    score = 0
    city_questions =[("ما هو اسم المدينه التي  تعتبر العاصمه السياسيه و الإدارية للمملكه","الرياض") ,
("ما هو اسم المدينة  التي يوجد فيها المسجد الحرام و الكعبة المشرفة","مكة"),
("ما هو اسم مدينة التي يقال عنها عروس البحر الاحمر","جدة"),
("ما هو اسم المدينة التي يوجد فيها مسجد الرسول صلى الله عليه و سلم","المدينة المنورة"),
("ما هو اسم المدينة المهمه التي توجد على ساحل الخليج العربي ","الدمام")]
    print("\n---اسئلة عن مدننا---")
    for q, answer in city_questions:
        user = input(q+"؟")
        if user.strip() == answer:
            print("صحيح!✔️")
            score += 1
        else:
            print(f"خطأ!❌ الحواب الصحيح:{answer}")
    kings_questions =[
        ("من هو مؤسس المملكة العربية السعودية ","الملك عبدالعزيز"),
        ("من هو الملك الذي انطلقت في عهده رؤية 2030 ","الملك سلمان"),
        ("من هو الملك الذي اوقف تصدير النفط عام 1973 دعمًا للقضية الفلسطينية","الملك فيصل"),
        ("من هو اول ملك لقب بخادم الحرمين الشريفين","الملك فهد"),
        ("من هو الملك الذي لقب بملك الأنسانية و ملك القلوب","الملك عبدالله"),
        ("من هو الملك الذي كان اميرًا على الرياض لأكثر من 50 سنة قبل توليه الحكم ","الملك سلمان"),
        ("من هو الملك الذي كان يخاف من هيبته معظم قادة الدول ","الملك فيصل")
    ]
    print("\n---اسئلة الملوك---")
    for q, answer in kings_questions:
        user = input(q+"؟")
        if user.strip() == answer:
            print("صحيح!✔️")
            score += 1
        else:
            print(f"خطأ!❌ الحواب الصحيح:{answer}")
    print(f"\n انتهت المسابقة! مجموع نقاطك 🎉: {score}/{len(city_questions) + len(kings_questions)}")
national_quize()


